mcheah/Marlin4MPMD/STM32F070CB_SD_TEST/STM32F0xx_mpmd/stm32f0xx_mpmd.c
  if(ButtonMode == BUTTON_MODE_GPIO)
  {
    /* Configure Button pin as input */
    GPIO_InitStruct.Pin = BUTTON_PIN[Button];
    GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
    GPIO_InitStruct.Pull = GPIO_PULLUP; //GPIO_PULLDOWN;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(BUTTON_PORT[Button], &GPIO_InitStruct);
  }
  
  if(ButtonMode == BUTTON_MODE_EXTI)
  {
    /* Configure Button pin as input with External interrupt */
    GPIO_InitStruct.Pin = BUTTON_PIN[Button];
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    GPIO_InitStruct.Mode = GPIO_MODE_IT_FALLING; 
    HAL_GPIO_Init(BUTTON_PORT[Button], &GPIO_InitStruct);
    
    /* Enable and set Button EXTI Interrupt to the lowest priority */
    HAL_NVIC_SetPriority((IRQn_Type)(BUTTON_IRQn[Button]), 0x0F, 0x00);
    HAL_NVIC_EnableIRQ((IRQn_Type)(BUTTON_IRQn[Button]));
  }
}

/**
  * @brief  Push Button DeInit.
  * @param  Button: Button to be configured
  *   This parameter should be: BUTTON_USER
  * @note PB DeInit does not disable the GPIO clock
  */
void BSP_PB_DeInit(Button_TypeDef Button)
{
  GPIO_InitTypeDef gpio_init_structure;

  gpio_init_structure.Pin = BUTTON_PIN[Button];
  HAL_NVIC_DisableIRQ((IRQn_Type)(BUTTON_IRQn[Button]));
  HAL_GPIO_DeInit(BUTTON_PORT[Button], gpio_init_structure.Pin);
}

/**
  * @brief  Returns the selected Button state.
  * @param  Button: Specifies the Button to be checked.
  *   This parameter should be: BUTTON_USER  
  * @retval The Button GPIO pin value.
  */
uint32_t BSP_PB_GetState(Button_TypeDef Button)
{
  return HAL_GPIO_ReadPin(BUTTON_PORT[Button], BUTTON_PIN[Button]);
}

/******************************************************************************
                            BUS OPERATIONS
*******************************************************************************/
//#ifdef ADAFRUIT_TFT_JOY_SD_ID802
//
/******************************* SPI ********************************/
#ifdef HAL_SPI_MODULE_ENABLED

/**
  * @brief  Initializes SPI MSP.
  */
static void SPIx_MspInit(SPI_HandleTypeDef *hspi)
{
  GPIO_InitTypeDef  GPIO_InitStruct;

  /*** Configure the SPI peripheral ***/
  /* Enable SPI clock */
  NUCLEO_SPIx_CLK_ENABLE();

  /*** Configure the GPIOs ***/
  /* Enable GPIO clock */
  NUCLEO_SPIx_SCK_GPIO_CLK_ENABLE();
  NUCLEO_SPIx_MISO_MOSI_GPIO_CLK_ENABLE();

  /* Configure SPI SCK */
  GPIO_InitStruct.Pin = NUCLEO_SPIx_SCK_PIN;
#ifndef SOFTWARE_SPI
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
#else
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
#endif
  GPIO_InitStruct.Pull  = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
  GPIO_InitStruct.Alternate = NUCLEO_SPIx_SCK_AF;
  HAL_GPIO_Init(NUCLEO_SPIx_SCK_GPIO_PORT, &GPIO_InitStruct);

  /* Configure SPI MISO and MOSI */
  GPIO_InitStruct.Pin = NUCLEO_SPIx_MOSI_PIN;
#ifndef SOFTWARE_SPI
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
#else
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
#endif
  GPIO_InitStruct.Alternate = NUCLEO_SPIx_MISO_MOSI_AF;
  GPIO_InitStruct.Pull  = GPIO_NOPULL;
  HAL_GPIO_Init(NUCLEO_SPIx_MISO_MOSI_GPIO_PORT, &GPIO_InitStruct);

  GPIO_InitStruct.Pin = NUCLEO_SPIx_MISO_PIN;
#ifndef SOFTWARE_SPI
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
#else
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
#endif
//  GPIO_InitStruct.Pull  = GPIO_NOPULL;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  HAL_GPIO_Init(NUCLEO_SPIx_MISO_MOSI_GPIO_PORT, &GPIO_InitStruct);


}

/**
  * @brief  Initializes SPI HAL.
  */
static void SPIx_Init(void)
{
  if(HAL_SPI_GetState(&hnucleo_Spi) == HAL_SPI_STATE_RESET)
  {
    /* SPI Config */
    hnucleo_Spi.Instance = NUCLEO_SPIx;
    /* SPI configuration contraints
          - ST7735 LCD SPI interface max baudrate is 15MHz for write and 6.66MHz for read
            Since the provided driver doesn't use read capability from LCD, only constraint
            on write baudrate is considered.
          - SD card SPI interface max baudrate is 25MHz for write/read
       to feat these constraints SPI baudrate is set to:
	      - For STM32F412ZG devices: 12,5 MHz maximum (PCLK2/SPI_BAUDRATEPRESCALER_8 = 100 MHz/8 = 12,5 MHz)
		  - For STM32F446ZE/STM32F429ZI devices: 11,25 MHz maximum (PCLK2/SPI_BAUDRATEPRESCALER_8 = 90 MHz/8 = 11,25 MHz)
    */
    hnucleo_Spi.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_16;
    hnucleo_Spi.Init.Direction = SPI_DIRECTION_2LINES;
    hnucleo_Spi.Init.CLKPhase = SPI_PHASE_2EDGE;
    hnucleo_Spi.Init.CLKPolarity = SPI_POLARITY_HIGH;
    hnucleo_Spi.Init.CRCCalculation = SPI_CRCCALCULATION_DISABLE;
    hnucleo_Spi.Init.CRCPolynomial = 7;
    hnucleo_Spi.Init.DataSize = SPI_DATASIZE_8BIT;
    hnucleo_Spi.Init.FirstBit = SPI_FIRSTBIT_MSB;
    hnucleo_Spi.Init.NSS = SPI_NSS_SOFT;
    hnucleo_Spi.Init.TIMode = SPI_TIMODE_DISABLE;
    hnucleo_Spi.Init.Mode = SPI_MODE_MASTER;

    SPIx_MspInit(&hnucleo_Spi);
#ifndef SOFTWARE_SPI
    HAL_SPI_Init(&hnucleo_Spi);
#endif
  }
}

static uint8_t SWSPISendReceive(uint8_t txdata) {
  uint8_t rxdata = 0;
  uint8_t txxdata = 0;
  // no interrupts during byte send - about 8 us
BSP_LED_Toggle(LED3);
//  cli();
  for (uint8_t i = 0; i < 8; i++) {
	GPIO_PinState level = txdata & 0X80 ? GPIO_PIN_SET : GPIO_PIN_RESET;
	if(level==GPIO_PIN_SET)
		txxdata |= 1;
	HAL_GPIO_WritePin(NUCLEO_SPIx_MISO_MOSI_GPIO_PORT,NUCLEO_SPIx_MOSI_PIN,level);
	HAL_GPIO_WritePin(NUCLEO_SPIx_SCK_GPIO_PORT,NUCLEO_SPIx_SCK_PIN,GPIO_PIN_RESET);
//    fastDigitalWrite(SPI_SCK_PIN, LOW);

//    fastDigitalWrite(SPI_MOSI_PIN, txdata & 0X80);
	delay_basic(50e-6);
//	HAL_Delay(1);
//    nop;
//    nop;

    txdata <<= 1;
	rxdata <<= 1;
	txxdata <<= 1;
	if(HAL_GPIO_ReadPin(NUCLEO_SPIx_MISO_MOSI_GPIO_PORT,NUCLEO_SPIx_MISO_PIN)==GPIO_PIN_SET)
//    if (fastDigitalRead(SPI_MISO_PIN))
    	rxdata |= 1;
	HAL_GPIO_WritePin(NUCLEO_SPIx_SCK_GPIO_PORT,NUCLEO_SPIx_SCK_PIN,GPIO_PIN_SET);
//    fastDigitalWrite(SPI_SCK_PIN, HIGH);
//	HAL_Delay(1);
	delay_basic(50e-6);

  }
//  HAL_Delay(1);
	delay_basic(50e-6);

  // hold SCK high for a few ns
//  nop;
//  nop;
//  nop;
//  nop;

  HAL_GPIO_WritePin(NUCLEO_SPIx_SCK_GPIO_PORT,NUCLEO_SPIx_SCK_PIN,GPIO_PIN_SET);
  // enable interrupts
//  sei();
  return rxdata;
}

/**
  * @brief  SPI Write a byte to device
  * @param  DataIn: value to be written
  * @param  DataOut: value to read
  * @param  DataLegnth: length of data
  */
static void SPIx_WriteReadData(const uint8_t *DataIn, uint8_t *DataOut, uint16_t DataLegnth)
{
  HAL_StatusTypeDef status = HAL_OK;
#ifdef SOFTWARE_SPI
  for(uint16_t i=0;i<DataLegnth;i++)
  {
	  DataOut[i] = SWSPISendReceive(DataIn[i]);
  }
#else
  status = HAL_SPI_TransmitReceive(&hnucleo_Spi, (uint8_t*) DataIn, DataOut, DataLegnth, SpixTimeout);
#endif
  /* Check the communication status */
  if(status != HAL_OK)
  {
    /* Execute user timeout callback */
    SPIx_Error();
  }
}

/**
  * @brief  SPI Write a byte to device.
  * @param  Value: value to be written
  */
//static void SPIx_Write(uint8_t Value)
//{
//  HAL_StatusTypeDef status = HAL_OK;
//  uint8_t data;
//
//  status = HAL_SPI_TransmitReceive(&hnucleo_Spi, (uint8_t*) &Value, &data, 1, SpixTimeout);
//
//  /* Check the communication status */
//  if(status != HAL_OK)
//  {
//    /* Execute user timeout callback */
//    SPIx_Error();
//  }
//}

/**
  * @brief  SPI error treatment function
  */
static void SPIx_Error (void)
{
  /* De-initialize the SPI communication BUS */
  HAL_SPI_DeInit(&hnucleo_Spi);

  /* Re-Initiaize the SPI communication BUS */
  SPIx_Init();
}

